# PrevSymDef

## Description
Function PrevSymDef returns a handle to the symbol definition in the symbol library preceding the referenced definition.

```pascal
FUNCTION PrevSymDef(symHd : HANDLE): HANDLE;
```

```python
def vs.PrevSymDef(symHd):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|symHd|HANDLE|Handle to symbol definition.|

## Version
Availability: from All Versions

## Category
* Document List Handling